[
    {
        "name": "Plato",
        "biography": "Plato was a philosopher in Classical Greece and the founder of the Academy in Athens, the first institution of higher learning in the Western world. Born around 428/427 BCE in Athens, he was a student of Socrates and the teacher of Aristotle. His writings explored justice, beauty, equality, and the theory of forms, where he proposed that the material world is only a shadow of the true reality. Plato's influence on philosophy and the intellectual tradition has been profound.",
        "ideology": "Idealism",
        "quotes": [
            "The greatest wealth is to live content with little.",
            "Wise men speak because they have something to say; fools because they have to say something.",
            "The beginning is the most important part of the work.",
            "Knowledge without justice ought to be called cunning rather than wisdom.",
            "Courage is knowing what not to fear.",
            "Opinion is the medium between knowledge and ignorance.",
            "The measure of a man is what he does with power.",
            "There are two things a person should never be angry at, what they can help, and what they cannot.",
            "Good people do not need laws to tell them to act responsibly, while bad people will find a way around the laws.",
            "At the touch of love, everyone becomes a poet.",
            "Necessity is the mother of invention.",
            "A good decision is based on knowledge and not on numbers.",
            "Human behavior flows from three main sources: desire, emotion, and knowledge.",
            "He who is not a good servant will not be a good master.",
            "No one is more hated than he who speaks the truth.",
            "The direction in which education starts a man will determine his future in life.",
            "There is no harm in repeating a good thing.",
            "The unexamined life is not worth living.",
            "He who commits injustice is ever made more wretched than he who suffers it.",
            "Love is a serious mental disease."
        ]
    },
    {
        "name": "Aristotle",
        "biography": "Aristotle was a Greek philosopher and polymath during the Classical period in Ancient Greece. Born in 384 BCE in Stagira, he was a student of Plato and later became the tutor of Alexander the Great. Aristotle's writings cover many subjects, including physics, biology, metaphysics, logic, ethics, and politics. He is considered one of the greatest intellectual figures of Western history. His views on the natural world, logic, and metaphysics shaped centuries of philosophy and science.",
        "ideology": "Empiricism",
        "quotes": [
            "Knowing yourself is the beginning of all wisdom.",
            "It is the mark of an educated mind to be able to entertain a thought without accepting it.",
            "Patience is bitter, but its fruit is sweet.",
            "Pleasure in the job puts perfection in the work.",
            "Happiness depends upon ourselves.",
            "The roots of education are bitter, but the fruit is sweet.",
            "We are what we repeatedly do. Excellence, then, is not an act, but a habit.",
            "The whole is more than the sum of its parts.",
            "The energy of the mind is the essence of life.",
            "Friendship is a single soul dwelling in two bodies.",
            "He who has overcome his fears will truly be free.",
            "Hope is a waking dream.",
            "Wishing to be friends is quick work, but friendship is a slow ripening fruit.",
            "The more you know, the more you realize you don't know.",
            "In all things of nature there is something of the marvelous.",
            "The aim of art is to represent not the outward appearance of things, but their inward significance.",
            "All men by nature desire to know.",
            "It is not enough to win a war; it is more important to organize the peace.",
            "The high-minded man must care more for the truth than for what people think.",
            "What is a friend? A single soul dwelling in two bodies."
        ]
    },
    {
        "name": "Socrates",
        "biography": "Socrates was a classical Greek philosopher credited as one of the founders of Western philosophy. He is an enigmatic figure known chiefly through the accounts of later classical writers, especially the writings of his students Plato and Xenophon. Socrates' most important contribution to Western thought is his dialectic method of inquiry, known as the Socratic Method.",
        "ideology": "Socratic Method",
        "quotes": [
            "The only true wisdom is in knowing you know nothing.",
            "I cannot teach anybody anything, I can only make them think.",
            "To find yourself, think for yourself.",
            "The unexamined life is not worth living.",
            "Wonder is the beginning of wisdom.",
            "Be as you wish to seem.",
            "True knowledge exists in knowing that you know nothing.",
            "I know that I am intelligent, because I know that I know nothing.",
            "He who is not contented with what he has, would not be contented with what he would like to have.",
            "The greatest way to live with honor in this world is to be what we pretend to be.",
            "Let him that would move the world first move himself.",
            "Death may be the greatest of all human blessings.",
            "I know nothing except the fact of my ignorance.",
            "Wisdom begins in wonder.",
            "He is richest who is content with the least, for content is the wealth of nature.",
            "An unexamined life is not worth living.",
            "There is only one good, knowledge, and one evil, ignorance.",
            "The only good is knowledge and the only evil is ignorance.",
            "To know, is to know that you know nothing. That is the meaning of true knowledge.",
            "Beware the barrenness of a busy life."
        ]
    },
    {
        "name": "Confucius",
        "biography": "Confucius was a Chinese philosopher and politician of the Spring and Autumn period who is traditionally considered the paragon of Chinese sages. His philosophy emphasized personal and governmental morality, correctness of social relationships, justice, kindness, and sincerity. His followers competed successfully with many other schools during the Hundred Schools of Thought era only to be suppressed in favor of the Legalists during the Qin dynasty.",
        "ideology": "Confucianism",
        "quotes": [
            "It does not matter how slowly you go as long as you do not stop.",
            "Our greatest glory is not in never falling, but in rising every time we fall.",
            "Real knowledge is to know the extent of one's ignorance.",
            "When we see men of a contrary character, we should turn inwards and examine ourselves.",
            "The man who moves a mountain begins by carrying away small stones.",
            "To see what is right and not do it is the want of courage.",
            "Silence is a true friend who never betrays.",
            "What you do not want done to yourself, do not do to others.",
            "To be wronged is nothing unless you continue to remember it.",
            "Respect yourself and others will respect you.",
            "When it is obvious that the goals cannot be reached, don't adjust the goals, adjust the action steps.",
            "Wisdom, compassion, and courage are the three universally recognized moral qualities of men.",
            "The superior man is modest in his speech but exceeds in his actions.",
            "If you think in terms of a year, plant a seed; if in terms of ten years, plant trees; if in terms of 100 years, teach the people.",
            "The more man meditates upon good thoughts, the better will be his world and the world at large.",
            "Study the past if you would define the future.",
            "He who learns but does not think, is lost! He who thinks but does not learn is in great danger.",
            "The cautious seldom err.",
            "By three methods we may learn wisdom: First, by reflection, which is noblest; Second, by imitation, which is easiest; and third by experience, which is the bitterest.",
            "To know what you know and what you do not know, that is true knowledge."
        ]
    },
    {
        "name": "Immanuel Kant",
        "biography": "Immanuel Kant was a German philosopher who is a central figure in modern philosophy. Born on April 22, 1724, in Königsberg, Prussia (now Kaliningrad, Russia), Kant's comprehensive and systematic works in epistemology, metaphysics, ethics, and aesthetics have profoundly influenced all subsequent philosophy. He synthesized early modern rationalism and empiricism, setting the terms for much of 19th and 20th-century philosophy. Kant is known for his doctrine of transcendental idealism, which argues that space, time, and causation are mere sensibilities; things-in-themselves exist but their nature is unknowable. He also developed the theory of the categorical imperative, a central concept in his moral philosophy, emphasizing duty, moral law, and the necessity of good will.",
        "ideology": "Transcendental Idealism",
        "quotes": [
            "Science is organized knowledge. Wisdom is organized life.",
            "We are not rich by what we possess but by what we can do without.",
            "Act only according to that maxim whereby you can at the same time will that it should become a universal law.",
            "Happiness is not an ideal of reason but of imagination.",
            "Live your life as though your every act were to become a universal law.",
            "Two things awe me most, the starry sky above me and the moral law within me.",
            "Ingratitude is the essence of vileness.",
            "Immaturity is the incapacity to use one's intelligence without the guidance of another.",
            "Morality is not properly the doctrine of how we may make ourselves happy, but how we may make ourselves worthy of happiness.",
            "He who is cruel to animals becomes hard also in his dealings with men. We can judge the heart of a man by his treatment of animals.",
            "All our knowledge begins with the senses, proceeds then to the understanding, and ends with reason. There is nothing higher than reason.",
            "Experience without theory is blind, but theory without experience is mere intellectual play.",
            "It is beyond a doubt that all our knowledge begins with experience.",
            "Have the courage to use your own understanding.",
            "Metaphysics is a dark ocean without shores or lighthouse, strewn with many a philosophic wreck.",
            "Always recognize that human individuals are ends, and do not use them as means to your end.",
            "Out of the crooked timber of humanity, no straight thing was ever made.",
            "Seek not the favor of the multitude; it is seldom got by honest and lawful means. But seek the testimony of few; and number not voices, but weigh them.",
            "Thoughts without content are empty, intuitions without concepts are blind.",
            "The death of dogma is the birth of morality."
        ]
    },
    {
        "name": "Laozi",
        "biography": "Laozi, also known as Lao Tzu, was an ancient Chinese philosopher and writer. He is best known as the author of the Tao Te Ching and the founder of philosophical Taoism. The details of his life are uncertain, and he is traditionally held to have lived in the 6th century BCE. Laozi's philosophy emphasizes living in harmony with the Tao, the fundamental principle of the universe that is ineffable and cannot be defined. His teachings advocate humility, simplicity, and spontaneity as paths to inner peace and wisdom.",
        "ideology": "Taoism",
        "quotes": [
            "The journey of a thousand miles begins with one step.",
            "Nature does not hurry, yet everything is accomplished.",
            "He who knows others is wise; he who knows himself is enlightened.",
            "A leader is best when people barely know he exists, when his work is done, his aim fulfilled, they will say: we did it ourselves.",
            "When I let go of what I am, I become what I might be.",
            "Mastering others is strength. Mastering yourself is true power.",
            "To attain knowledge, add things every day. To attain wisdom, subtract things every day.",
            "Kindness in words creates confidence. Kindness in thinking creates profoundness. Kindness in giving creates love.",
            "Silence is a source of great strength.",
            "Being deeply loved by someone gives you strength, while loving someone deeply gives you courage.",
            "The wise man is one who knows what he does not know.",
            "The more laws and order are made prominent, the more thieves and robbers there will be.",
            "Life is a series of natural and spontaneous changes. Don’t resist them – that only creates sorrow. Let reality be reality. Let things flow naturally forward in whatever way they like.",
            "When you are content to be simply yourself and don’t compare or compete, everyone will respect you.",
            "He who conquers others is strong; he who conquers himself is mighty.",
            "Respond intelligently even to unintelligent treatment.",
            "The truth is not always beautiful, nor beautiful words the truth.",
            "Give evil nothing to oppose and it will disappear by itself.",
            "The softest things in the world overcome the hardest things in the world.",
            "Knowing others is intelligence; knowing yourself is true wisdom."
        ]
    },
    {
        "name": "Epicurus",
        "biography": "Epicurus was an ancient Greek philosopher who founded the school of philosophy called Epicureanism. Born in 341 BCE on the island of Samos, he established his school, the Garden, in Athens around 306 BCE. Epicurus taught that the purpose of philosophy was to attain a happy, tranquil life characterized by ataraxia (peace and freedom from fear) and aponia (the absence of bodily pain). He believed that pleasure was the greatest good and that mental pleasures were superior to physical ones. Epicurus's teachings profoundly influenced later philosophical movements, including Stoicism and Neoplatonism.",
        "ideology": "Epicureanism",
        "quotes": [
            "It is impossible to live a pleasant life without living wisely and honorably and justly, and it is impossible to live wisely and honorably and justly without living pleasantly.",
            "Death does not concern us, because as long as we exist, death is not here. And when it does come, we no longer exist.",
            "Do not spoil what you have by desiring what you have not; remember that what you now have was once among the things you only hoped for.",
            "The greatest fruit of self-sufficiency is freedom.",
            "The art of living well and the art of dying well are one.",
            "It is better for you to be free of fear lying upon a pallet, than to have a golden couch and a rich table and be full of trouble.",
            "Not what we have, but what we enjoy, constitutes our abundance.",
            "Of all the means to ensure happiness throughout the whole life, by far the most important is the acquisition of friends.",
            "He who is not satisfied with a little, is satisfied with nothing.",
            "Let no one be slow to seek wisdom when he is young nor weary in the search of it when he has grown old. For no age is too early or too late for the health of the soul.",
            "The time when most of you should withdraw into yourself is when you are forced to be in a crowd.",
            "It is folly for a man to pray to the gods for that which he has the power to obtain by himself.",
            "If thou wilt make a man happy, add not unto his riches but take away from his desires.",
            "We do not so much need the help of our friends as the confidence of their help in need.",
            "He who has peace of mind disturbs neither himself nor another.",
            "The just man is most free from disturbance, while the unjust is full of the utmost disturbance.",
            "Natural justice is a symbol or expression of usefulness, to prevent one person from harming or being harmed by another.",
            "The wealth required by nature is limited and is easy to procure; but the wealth required by vain ideals extends to infinity.",
            "It is not so much our friends' help that helps us as the confident knowledge that they will help us.",
            "Nothing satisfies him who is not content with a little."
        ]
    },
    {
        "name": "Zeno of Citium",
        "biography": "Zeno of Citium was an ancient Greek philosopher who founded the school of philosophy known as Stoicism. Born around 334 BCE in Citium, Cyprus, he moved to Athens where he studied under Crates of Thebes, a Cynic philosopher. Zeno taught in the Stoa Poikile (Painted Porch) in Athens, which gave Stoicism its name. His teachings emphasized living in accordance with nature, cultivating virtue, and accepting whatever happens with indifference to pleasure or pain. Zeno's philosophy had a profound influence on Roman Stoics such as Seneca, Epictetus, and Marcus Aurelius, and it continues to influence ethical and moral philosophy today.",
        "ideology": "Stoicism",
        "quotes": [
            "Man conquers the world by conquering himself.",
            "The goal of life is living in agreement with nature.",
            "Happiness is a good flow of life.",
            "The wise man belongs to all countries, for the home of a great soul is the whole world.",
            "A bad feeling is a commotion of the mind repugnant to reason, and against nature.",
            "I made a mistake; I admit that I am a fool, but I am learning. We can avoid making mistakes by guiding our life according to reason, the truth in the things that come our way.",
            "Good character is not formed in a week or a month. It is created little by little, day by day. Protracted and patient effort is needed to develop good character.",
            "Bear in mind that you should conduct yourself in life as at a feast.",
            "Well-being is realized by small steps, but is truly no small thing.",
            "No great thing is created suddenly.",
            "A wise man does not engage in reasoning about things beyond human understanding.",
            "What helps the soul to be free from passion and disturbance? Wisdom, self-control, and justice.",
            "Only the educated are free.",
            "It is more necessary for the soul to be cured than the body, for it is better to die than to live badly.",
            "Man conquers the world by conquering himself.",
            "It is difficult to fight against desire; but to overcome it is the mark of a reasonable man.",
            "Duties are universally binding on man, whether he accepts them or does not.",
            "The reason for the good is the only good.",
            "In the treatment of all the arts, man is proud of his talents and thinks that he has come to a certain level of knowledge; but in the art of the life of a person, the person may be rejected as having come to the next stage, and is not worthy of praise, and that there is no good thing to be done or not to be done.",
            "Because of the good deed done by the Lord, let the life of the righteous be good, so you do not I?"
        ]
    },
    {
        "name": "Marcus Aurelius",
        "biography": "Marcus Aurelius was a Roman emperor from 161 to 180 AD and a Stoic philosopher. Born in 121 AD in Rome, he became emperor following the death of Antoninus Pius. Marcus Aurelius is best known for his philosophical writings, particularly the 'Meditations,' which reflect his Stoic philosophy and personal reflections on leadership, duty, and virtue. His reign was marked by wars and external threats, yet he is remembered for his wisdom, humility, and commitment to Stoic principles amidst adversity.",
        "ideology": "Stoicism",
        "quotes": [
            "The happiness of your life depends upon the quality of your thoughts.",
            "Waste no more time arguing what a good man should be. Be one.",
            "The universe is change; our life is what our thoughts make it.",
            "Very little is needed to make a happy life; it is all within yourself, in your way of thinking.",
            "When you arise in the morning think of what a privilege it is to be alive, to think, to enjoy, to love...",
            "If it is not right, do not do it, if it is not true, do not say it.",
            "The soul becomes dyed with the color of its thoughts.",
            "Accept the things to which fate binds you, and love the people with whom fate brings you together, but do so with all your heart.",
            "The best revenge is to be unlike him who performed the injury.",
            "Our life is what our thoughts make it.",
            "The object of life is not to be on the side of the majority, but to escape finding oneself in the ranks of the insane.",
            "Everything we hear is an opinion, not a fact. Everything we see is a perspective, not the truth.",
            "You have power over your mind - not outside events. Realize this, and you will find strength.",
            "The soul becomes dyed with the color of its thoughts.",
            "The happiness of your life depends upon the quality of your thoughts.",
            "Waste no more time arguing what a good man should be. Be one.",
            "The universe is change; our life is what our thoughts make it.",
            "Very little is needed to make a happy life; it is all within yourself, in your way of thinking.",
            "When you arise in the morning think of what a privilege it is to be alive, to think, to enjoy, to love...",
            "If it is not right, do not do it, if it is not true, do not say it."
        ]
    },
    {
        "name": "Thomas Aquinas",
        "biography": "Thomas Aquinas was an Italian Dominican friar, philosopher, Catholic priest, and Doctor of the Church. Born in 1225 in Aquino, Italy, he was an influential philosopher and theologian of the Medieval period. Aquinas is best known for his synthesis of Aristotelian philosophy with Christian theology, often referred to as Thomism. His works, including 'Summa Theologica,' are among the most important and influential in Western thought. Aquinas's philosophy emphasizes the harmony between faith and reason, natural law, and the pursuit of truth through rational inquiry.",
        "ideology": "Thomism",
        "quotes": [
            "To one who has faith, no explanation is necessary. To one without faith, no explanation is possible.",
            "The things that we love tell us what we are.",
            "Better to illuminate than merely to shine, to deliver to others contemplated truths than merely to contemplate.",
            "The greatest kindness one can render to any man consists in leading him from error to truth.",
            "Beware of the person of one book.",
            "Three things are necessary for the salvation of man: to know what he ought to believe; to know what he ought to desire; and to know what he ought to do.",
            "There is nothing on this earth more to be prized than true friendship.",
            "There is within every soul a thirst for happiness and meaning.",
            "The soul is like an uninhabited world that comes to life only when God lays His head against us.",
            "Faith has to do with things that are not seen and hope with things that are not at hand.",
            "Love takes up where knowledge leaves off.",
            "There is nothing on this earth more to be prized than true friendship.",
            "To love God is something greater than to know Him.",
            "Because philosophy arises from awe, a philosopher is bound in his way to be a lover of myths and poetic fables. Poets and philosophers are alike in being big with wonder.",
            "Love takes up where knowledge leaves off.",
            "The things that we love tell us what we are.",
            "To one who has faith, no explanation is necessary. To one without faith, no explanation is possible.",
            "Better to illuminate than merely to shine, to deliver to others contemplated truths than merely to contemplate.",
            "The greatest kindness one can render to any man consists in leading him from error to truth.",
            "Beware of the person of one book."
        ]
    },
    {
        "name": "René Descartes",
        "biography": "René Descartes was a French philosopher, mathematician, and scientist, born on March 31, 1596, in La Haye en Touraine, France. Descartes is often referred to as the 'father of modern philosophy' due to his influential work in the development of a new, methodical approach to philosophical inquiry. His most famous statement, 'Cogito, ergo sum' (I think, therefore I am), encapsulates his argument for the certainty of self-existence. Descartes' major works include 'Meditations on First Philosophy,' 'Discourse on the Method,' and 'Principles of Philosophy.' His philosophy emphasizes the use of reason as the foundation for knowledge and scientific inquiry.",
        "ideology": "Rationalism",
        "quotes": [
            "Cogito, ergo sum. (I think, therefore I am.)",
            "The reading of all good books is like a conversation with the finest minds of past centuries.",
            "The preservation of health should be the first study of one who is of any worth to oneself.",
            "Except our own thoughts, there is nothing absolutely in our power.",
            "If you would be a real seeker after truth, it is necessary that at least once in your life you doubt, as far as possible, all things.",
            "The first precept was never to accept a thing as true until I knew it as such without a single doubt.",
            "It is not enough to possess a good mind; the most important thing is to apply it correctly.",
            "To live without philosophizing is in truth the same as keeping the eyes closed without attempting to open them.",
            "I am accustomed to sleep and in my dreams to imagine the same things that lunatics imagine when awake.",
            "The greatest minds are capable of the greatest vices as well as of the greatest virtues.",
            "Each problem that I solved became a rule, which served afterwards to solve other problems.",
            "When it is not in our power to follow what is true, we ought to follow what is most probable.",
            "Divide each difficulty into as many parts as is feasible and necessary to resolve it.",
            "To know what people really think, pay regard to what they do, rather than what they say.",
            "The chief cause of human errors is to be found in the prejudices picked up in childhood.",
            "The senses deceive from time to time, and it is prudent never to trust wholly those who have deceived us even once.",
            "In order to improve the mind, we ought less to learn, than to contemplate.",
            "It is only prudent never to place complete confidence in that by which we have even once been deceived.",
            "I hope that posterity will judge me kindly, not only as to the things which I have explained, but also to those which I have intentionally omitted so as to leave to others the pleasure of discovery.",
            "The long chains of perfectly simple and easy reasonings by means of which geometers are accustomed to carry out their most difficult operations have led me to imagine that all things, to the knowledge of which man is competent, are interconnected in the same way."
        ]
    },
    {
        "name": "Baruch Spinoza",
        "biography": "Baruch Spinoza was a Dutch philosopher of Sephardi/Portuguese origin, born on November 24, 1632, in Amsterdam. He is considered one of the great rationalists of the 17th century. His magnum opus, 'Ethics,' was published posthumously and laid the groundwork for the Enlightenment. Spinoza's philosophy revolves around the idea of a single substance, 'God or Nature,' and he is known for his deterministic view of the universe, pantheism, and his radical critique of traditional religion and metaphysics.",
        "ideology": "Rationalism, Pantheism",
        "quotes": [
            "The highest activity a human being can attain is learning for understanding, because to understand is to be free.",
            "Peace is not the absence of war, but a virtue based on strength of character.",
            "The more clearly you understand yourself and your emotions, the more you become a lover of what is.",
            "I have striven not to laugh at human actions, not to weep at them, nor to hate them, but to understand them.",
            "Whatsoever is, is in God, and without God nothing can be, or be conceived.",
            "The world would be happier if men had the same capacity to be silent that they have to speak.",
            "The more we love God, the more we endeavor to act out of a love of God, and thus the more we understand God.",
            "Those who are governed by reason desire nothing for themselves which they do not also desire for the rest of humankind.",
            "Man is a social animal, capable of obtaining pleasure from society.",
            "He who loves God cannot endeavor that God should love him in return.",
            "The endeavor to understand is the first and only basis of virtue.",
            "Reason is nothing else but an internal speech, which we use in making our conclusions and in proving them.",
            "Nothing in nature is by chance; Something appears to be chance only because of our lack of knowledge.",
            "I call him free who is led solely by reason.",
            "All happiness or unhappiness solely depends upon the quality of the object to which we are attached by love."
        ]
    },
    {
        "name": "Gottfried Wilhelm Leibniz",
        "biography": "Gottfried Wilhelm Leibniz was a German polymath and philosopher, born on July 1, 1646, in Leipzig. He made significant contributions to philosophy, mathematics, and science. Leibniz is best known for his development of calculus independently of Isaac Newton, as well as his philosophy of monadology, which posits that the universe is composed of simple substances known as monads. His optimistic philosophy, encapsulated in the idea that we live in 'the best of all possible worlds,' profoundly influenced subsequent philosophical thought.",
        "ideology": "Rationalism, Monadology",
        "quotes": [
            "The present is big with the future.",
            "The ultimate reason of things must lie in a necessary substance, which we call God.",
            "Reality cannot be found except in One single source, because of the interconnection of all things with one another.",
            "There are two kinds of truths: truths of reasoning and truths of fact.",
            "Music is a hidden arithmetic exercise of the soul, which does not know that it is counting.",
            "I do not conceive of any reality at all as without genuine unity.",
            "The knowledge of how to judge a thing properly is acquired by knowing and understanding its causes.",
            "We live in the best of all possible worlds.",
            "Nothing is accomplished all at once, and it is one of the laws of nature that all things should be constantly changed and renewed.",
            "It is evident that the infinite multitude of simple substances, or monads, must exist in this way.",
            "Justice is charity in accordance with wisdom.",
            "Every substance is like a complete world and a mirror of God or of the whole universe.",
            "To love is to place our happiness in the happiness of another.",
            "It is necessary to admit a world of things that are merely possible, for otherwise nothing would be possible.",
            "The soul is the mirror of an indestructible universe."
        ]
    },
    {
        "name": "Georg Wilhelm Friedrich Hegel",
        "biography": "Georg Wilhelm Friedrich Hegel was a German philosopher born on August 27, 1770, in Stuttgart. He is considered one of the most important figures in German idealism and is known for his dialectical method, which involves the reconciliation of opposites through their synthesis. Hegel's major works include 'Phenomenology of Spirit,' 'Science of Logic,' and 'Elements of the Philosophy of Right.' His philosophy has profoundly influenced many subsequent thinkers, particularly in the areas of history, politics, and metaphysics.",
        "ideology": "German Idealism, Dialectics",
        "quotes": [
            "The only thing we learn from history is that we learn nothing from history.",
            "We may affirm absolutely that nothing great in the world has been accomplished without passion.",
            "To be independent of public opinion is the first formal condition of achieving anything great.",
            "The truth is the whole.",
            "An idea is always a generalization, and generalization is a property of thinking. To generalize means to think.",
            "Education is the art of making man ethical.",
            "Freedom is the recognition of necessity.",
            "The march of God in the world, that is what the state is.",
            "What is rational is actual and what is actual is rational.",
            "Nothing great in the world has been accomplished without passion.",
            "We learn from history that we do not learn from history.",
            "The spirit is never at rest, but always engaged in ever-progressive motion, giving itself new form.",
            "The owl of Minerva spreads its wings only with the falling of the dusk.",
            "Genuine tragedies in the world are not conflicts between right and wrong. They are conflicts between two rights.",
            "The heart that is bold is half the battle."
        ]
    },
    {
        "name": "Karl Marx",
        "biography": "Karl Marx was a German philosopher, economist, historian, sociologist, political theorist, journalist, and socialist revolutionary. Born on May 5, 1818, in Trier, he is best known for his works 'The Communist Manifesto' and 'Das Kapital,' which laid the foundations for modern socialism and communism. Marx's theories on society, economics, and politics, collectively understood as Marxism, argue that human societies progress through class struggle. He emphasized the materialist conception of history and the role of economic factors in societal development.",
        "ideology": "Marxism, Communism",
        "quotes": [
            "The philosophers have only interpreted the world, in various ways. The point, however, is to change it.",
            "From each according to his abilities, to each according to his needs.",
            "The history of all hitherto existing society is the history of class struggles.",
            "Religion is the opium of the masses.",
            "Workers of the world unite; you have nothing to lose but your chains.",
            "The production of too many useful things results in too many useless people.",
            "Social progress can be measured by the social position of the female sex.",
            "The ruling ideas of each age have ever been the ideas of its ruling class.",
            "Necessity is blind until it becomes conscious. Freedom is the consciousness of necessity.",
            "Democracy is the road to socialism.",
            "Reason has always existed, but not always in a reasonable form.",
            "The theory of Communism may be summed up in one sentence: Abolish all private property.",
            "History repeats itself, first as tragedy, second as farce.",
            "The production relations of every society form a whole.",
            "Revolutions are the locomotives of history."
        ]
    },
    {
        "name": "Jean-Paul Sartre",
        "biography": "Jean-Paul Sartre was a French existentialist philosopher, playwright, novelist, political activist, biographer, and literary critic. Born on June 21, 1905, in Paris, Sartre is known for his significant contributions to existentialism and phenomenology. His major works include 'Being and Nothingness,' 'Nausea,' and 'No Exit.' Sartre's philosophy emphasizes human freedom, the responsibility that comes with it, and the importance of living authentically. He was awarded the Nobel Prize in Literature in 1964 but declined it.",
        "ideology": "Existentialism, Phenomenology",
        "quotes": [
            "Existence precedes essence.",
            "Man is condemned to be free; because once thrown into the world, he is responsible for everything he does.",
            "Hell is other people.",
            "Life has no meaning the moment you lose the illusion of being eternal.",
            "Freedom is what we do with what is done to us.",
            "One is not born, but rather becomes, a woman.",
            "If you are lonely when you're alone, you are in bad company.",
            "There is no reality except in action.",
            "We do not judge the people we love.",
            "Commitment is an act, not a word.",
            "It is only in our decisions that we are important.",
            "Every existing thing is born without reason, prolongs itself out of weakness, and dies by chance.",
            "To know what life is worth you have to risk it once in a while.",
            "Man is fully responsible for his nature and his choices.",
            "Words are more treacherous and powerful than we think."
        ]
    },
    {
        "name": "Gautama Buddha",
        "biography": "Gautama Buddha, also known as Siddhartha Gautama, was a spiritual teacher and the founder of Buddhism. Born in the 6th century BCE in Lumbini (present-day Nepal), he was a prince who renounced his royal life to seek enlightenment. After years of meditation and ascetic practices, he attained enlightenment under the Bodhi tree and began teaching the Four Noble Truths and the Eightfold Path to liberation from suffering. His teachings have profoundly influenced various cultures and religious traditions in Asia and beyond.",
        "ideology": "Buddhism",
        "quotes": [
            "Do not dwell in the past, do not dream of the future, concentrate the mind on the present moment.",
            "Peace comes from within. Do not seek it without.",
            "The mind is everything. What you think you become.",
            "Health is the greatest gift, contentment the greatest wealth, faithfulness the best relationship.",
            "No one saves us but ourselves. No one can and no one may. We ourselves must walk the path.",
            "Holding on to anger is like drinking poison and expecting the other person to die.",
            "The only real failure in life is not to be true to the best one knows.",
            "Three things cannot be long hidden: the sun, the moon, and the truth.",
            "You, yourself, as much as anybody in the entire universe, deserve your love and affection.",
            "To keep the body in good health is a duty... otherwise we shall not be able to keep our mind strong and clear.",
            "There is no path to happiness: happiness is the path.",
            "In the end, only three things matter: how much you loved, how gently you lived, and how gracefully you let go of things not meant for you.",
            "Every morning we are born again. What we do today is what matters most.",
            "Your work is to discover your world and then with all your heart give yourself to it.",
            "The trouble is, you think you have time."
        ]
    },
    {
        "name": "Mahavira",
        "biography": "Mahavira, also known as Vardhamana, was an Indian spiritual teacher and the 24th Tirthankara of Jainism. Born in 599 BCE in Kundagrama (present-day Bihar, India), Mahavira renounced his royal life at the age of 30 to pursue spiritual awakening. After 12 years of intense meditation and ascetic practices, he attained Kevala Jnana (omniscience). He preached the principles of non-violence (ahimsa), truth (satya), non-stealing (asteya), celibacy (brahmacharya), and non-possession (aparigraha). His teachings form the core of Jain philosophy and continue to guide its followers.",
        "ideology": "Jainism",
        "quotes": [
            "Non-violence is the highest religion.",
            "Live and allow others to live; hurt no one; life is dear to all living beings.",
            "A man is seated on top of a tree in the midst of a burning forest. He sees all living beings perishing. But he does not realize that the same fate is soon going to overtake him also. That man is a fool.",
            "The soul comes alone and goes alone, no one accompanies it and no one becomes its mate.",
            "All human beings are miserable due to their own faults, and they themselves can be happy by correcting these faults.",
            "Fight with yourself, why fight with external foes? He who conquers himself through himself will obtain happiness.",
            "In happiness and suffering, in joy and grief, we should regard all creatures as we regard our own self.",
            "Silence and self-control is non-violence.",
            "There is no enemy out of your soul. The real enemies live inside yourself, they are anger, pride, greed, attachments, and hate.",
            "The one who neglects or disregards the existence of earth, air, fire, water, and vegetation, disregards his own existence which is entwined with them.",
            "A living body is not merely an integration of limbs and flesh but it is the abode of the soul which potentially has perfect perception, perfect knowledge, perfect power, and perfect bliss.",
            "The greatest mistake of a soul is non-recognition of its real self and can only be corrected by recognizing itself.",
            "Every soul is in itself absolutely omniscient and blissful. The bliss does not come from outside.",
            "The most important principle of environment is that you are not the only element.",
            "Don't kill any living beings. Don't try to rule them."
        ]
    },
    {
        "name": "Adi Shankara",
        "biography": "Adi Shankara, also known as Adi Shankaracharya, was an Indian philosopher and theologian who consolidated the doctrine of Advaita Vedanta. Born in 788 CE in Kaladi, Kerala, Shankara traveled extensively across the Indian subcontinent to propagate his philosophy through discourses and debates with other thinkers. His commentaries on the Upanishads, Bhagavad Gita, and Brahma Sutras laid the foundation for the revival of Hinduism in India. Shankara's teachings emphasize the non-duality of the Atman (soul) and Brahman (ultimate reality), asserting that the ultimate truth is beyond all forms and distinctions.",
        "ideology": "Advaita Vedanta",
        "quotes": [
            "Brahman is the truth, the world is an illusion, and there is ultimately no difference between Brahman and individual self.",
            "The world, like a dream full of attachments and aversions, seems real until the awakening.",
            "Knowledge cannot spring up by any other means than inquiry; 'Who am I? How was this universe born?' By such inquiry one gets knowledge.",
            "Like bubbles in the sea, all the worlds arise, exist, and dissolve in the Supreme Self, which is the material cause and basis of everything.",
            "When the mind becomes purified through knowledge, it turns away from the objective universe.",
            "As gold purified in the furnace loses its impurities and achieves its own true nature, so the mind through meditation sheds its ignorance and manifests itself in its true essence.",
            "He who realizes the Self through personal experience has no duties to perform; for him, the scripture has lost its importance.",
            "The intellect cannot illuminate itself; as it is illuminated by the self-luminous Atman.",
            "Just as the sun's light dispels the darkness, the knowledge of the Self destroys ignorance.",
            "There is no liberation for him who is bound by desires, nor is there liberation for him who is devoid of knowledge.",
            "The Self appears to be finite due to ignorance. When ignorance is destroyed, the Self, which is self-effulgent and infinite, shines forth by itself.",
            "Meditation on the Self is a hundred times superior to any form of religious observance.",
            "The pure mind is free from the impressions of the world and the ego.",
            "The Self, which is pure consciousness, cannot be known by the senses or the mind. It can only be realized through direct experience.",
            "A wise man should strive to purify his mind and intellect, for it is only through a pure mind that the Self is realized."
        ]
    },
    {
        "name": "Ramanuja",
        "biography": "Ramanuja was an Indian philosopher, theologian, and one of the most important exponents of the Vishishtadvaita (qualified non-dualism) school of Vedanta. Born in 1017 CE in Sriperumbudur, Tamil Nadu, he played a crucial role in reviving the Bhakti movement in India. Ramanuja's teachings emphasized the personal relationship between the individual soul (jiva) and the supreme being, Vishnu. His major works include the 'Sri Bhashya,' a commentary on the Brahma Sutras, and the 'Gita Bhashya,' a commentary on the Bhagavad Gita. Ramanuja's philosophy reconciles the dualism and non-dualism aspects of reality, advocating that while the individual soul is distinct from Brahman, it is also eternally connected to it.",
        "ideology": "Vishishtadvaita Vedanta",
        "quotes": [
            "Worship of the Lord is the path to liberation.",
            "Bhakti is the highest form of devotion and the easiest path to realize the divine.",
            "The individual soul is a part of Brahman and retains its individuality even after liberation.",
            "Knowledge of the self and the supreme is necessary for liberation.",
            "God is both immanent and transcendent, and the world is his manifestation.",
            "The ultimate goal of life is to realize one's eternal relationship with the supreme being.",
            "Love and compassion towards all beings are essential virtues for a devotee.",
            "The grace of God is essential for attaining liberation.",
            "True knowledge is recognizing the unity of the soul with the supreme being.",
            "Devotion is the natural state of the soul and the highest expression of its relationship with God.",
            "The divine resides in the hearts of all beings and can be realized through sincere devotion and service.",
            "The path of devotion is open to all, regardless of caste, creed, or gender.",
            "God is both the material and efficient cause of the universe.",
            "The individual soul is eternal and distinct, yet it is always dependent on the supreme being.",
            "Salvation is achieved through a combination of knowledge, devotion, and righteous living."
        ]
    },
    {
        "name": "Madhvacharya",
        "biography": "Madhvacharya, also known as Purna Prajna and Ananda Tirtha, was an Indian philosopher and the chief proponent of the Dvaita (dualism) school of Vedanta. Born in 1238 CE in Pajaka, Karnataka, he founded the Brahma Sampradaya and strongly emphasized the dualistic interpretation of the Vedas. Madhvacharya's philosophy asserts the fundamental difference between the individual soul (jiva) and the supreme being (Brahman), which he identified as Vishnu. His major works include commentaries on the Brahma Sutras, Bhagavad Gita, and ten Upanishads. Madhvacharya's teachings promote the idea that the soul and God are eternally distinct and that liberation is achieved through devotion and the grace of God.",
        "ideology": "Dvaita Vedanta",
        "quotes": [
            "God and the soul are eternally distinct.",
            "Devotion to God is the highest duty and the path to liberation.",
            "The supreme being is Vishnu, who is all-powerful and all-knowing.",
            "The world is real, and the differences between God, souls, and matter are real and eternal.",
            "True knowledge is realizing the eternal distinction between the soul and God.",
            "Salvation is achieved through unwavering devotion and surrender to God.",
            "The individual soul is dependent on God for its existence and liberation.",
            "God is the creator, sustainer, and destroyer of the universe.",
            "Righteous living and adherence to scriptural injunctions are essential for spiritual progress.",
            "God's grace is necessary for attaining liberation, and it is bestowed upon those who are devoted to Him.",
            "The material world is not an illusion but a real manifestation of God's will.",
            "The differences among individual souls are inherent and eternal.",
            "God is omnipresent, omnipotent, and omniscient, and He governs the universe with perfect justice and wisdom.",
            "Devotional practices, such as chanting the names of God and participating in religious rituals, are crucial for spiritual growth.",
            "The ultimate goal of life is to realize one's eternal relationship with God and serve Him with love and devotion."
        ]
    },
    {
        "name": "Chanakya",
        "biography": "Chanakya, also known as Kautilya or Vishnugupta, was an ancient Indian teacher, philosopher, economist, jurist, and royal advisor. Born in the 4th century BCE in Pataliputra (modern-day Patna), he is best known for his work 'Arthashastra,' a treatise on statecraft, economic policy, and military strategy. Chanakya played a crucial role in the establishment of the Maurya Empire by aiding Chandragupta Maurya in his rise to power. His teachings on politics, governance, and ethics have had a lasting influence on Indian thought and are still studied and respected today.",
        "ideology": "Political Realism, Arthashastra",
        "quotes": [
            "A person should not be too honest. Straight trees are cut first and honest people are screwed first.",
            "Education is the best friend. An educated person is respected everywhere. Education beats the beauty and the youth.",
            "Before you start some work, always ask yourself three questions – Why am I doing it, What the results might be, and Will I be successful. Only when you think deeply and find satisfactory answers to these questions, go ahead.",
            "As soon as the fear approaches near, attack and destroy it.",
            "The world's biggest power is the youth and beauty of a woman.",
            "Once you start working on something, don't be afraid of failure and don't abandon it. People who work sincerely are the happiest.",
            "The fragrance of flowers spreads only in the direction of the wind. But the goodness of a person spreads in all directions.",
            "A man is great by deeds, not by birth.",
            "There is some self-interest behind every friendship. There is no friendship without self-interests. This is a bitter truth.",
            "The life of an uneducated man is as useless as the tail of a dog which neither covers its rear end, nor protects it from the bites of insects.",
            "Even if a snake is not poisonous, it should pretend to be venomous.",
            "Before you start some work, always ask yourself three questions – Why am I doing it, What the results might be, and Will I be successful. Only when you think deeply and find satisfactory answers to these questions, go ahead.",
            "The king shall lose no time when the opportunity waited for arrives.",
            "A person should not be too honest. Straight trees are cut first and honest people are screwed first.",
            "There is no austerity equal to a balanced mind, and there is no happiness equal to contentment; there is no disease like covetousness, and no virtue like mercy."
        ]
    },
    {
        "name": "Swami Vivekananda",
        "biography": "Swami Vivekananda, born Narendranath Datta in 1863 in Kolkata, India, was a Hindu monk and a key figure in the introduction of Indian philosophies of Vedanta and Yoga to the Western world. A disciple of the mystic Ramakrishna, he founded the Ramakrishna Mission and the Ramakrishna Math. Vivekananda is best known for his speech at the Parliament of the World's Religions in Chicago in 1893, where he began with the words 'Sisters and Brothers of America.' His teachings emphasized the potential divinity of every soul and the importance of selfless service to humanity.",
        "ideology": "Vedanta, Yoga",
        "quotes": [
            "Arise, awake, and stop not until the goal is achieved.",
            "The greatest religion is to be true to your own nature. Have faith in yourselves.",
            "You have to grow from the inside out. None can teach you, none can make you spiritual. There is no other teacher but your own soul.",
            "In a conflict between the heart and the brain, follow your heart.",
            "All the powers in the universe are already ours. It is we who have put our hands before our eyes and cry that it is dark.",
            "The world is the great gymnasium where we come to make ourselves strong.",
            "Take up one idea. Make that one idea your life - think of it, dream of it, live on that idea. Let the brain, muscles, nerves, every part of your body, be full of that idea, and just leave every other idea alone. This is the way to success.",
            "The more we come out and do good to others, the more our hearts will be purified, and God will be in them.",
            "You cannot believe in God until you believe in yourself.",
            "The fire that warms us can also consume us; it is not the fault of the fire.",
            "All differences in this world are of degree, and not of kind, because oneness is the secret of everything.",
            "We are what our thoughts have made us; so take care about what you think. Words are secondary. Thoughts live; they travel far.",
            "Where can we go to find God if we cannot see Him in our own hearts and in every living being?",
            "Talk to yourself at least once in a day, otherwise you may miss meeting an excellent person in this world.",
            "Everything is easy when you are busy. But nothing is easy when you are lazy."
        ]
    },
    {
        "name": "Rabindranath Tagore",
        "biography": "Rabindranath Tagore was an Indian polymath who reshaped Bengali literature and music, as well as Indian art in the late 19th and early 20th centuries. Born in 1861 in Kolkata, India, he became the first non-European to win the Nobel Prize in Literature in 1913 for his collection of poems, 'Gitanjali.' Tagore's works, including novels, essays, short stories, and songs, explore themes of humanism, universalism, and the divine. His philosophy emphasizes the unity of all life and the interconnectedness of humanity with nature and the divine.",
        "ideology": "Humanism, Universalism",
        "quotes": [
            "You can't cross the sea merely by standing and staring at the water.",
            "Faith is the bird that feels the light when the dawn is still dark.",
            "Let your life lightly dance on the edges of time like dew on the tip of a leaf.",
            "The butterfly counts not months but moments, and has time enough.",
            "Death is not extinguishing the light; it is only putting out the lamp because the dawn has come.",
            "Every child comes with the message that God is not yet discouraged of man.",
            "The highest education is that which does not merely give us information but makes our life in harmony with all existence.",
            "The real friendship is like fluorescence, it shines better when everything has darkened.",
            "Don't limit a child to your own learning, for he was born in another time.",
            "I slept and dreamt that life was joy. I awoke and saw that life was service. I acted and behold, service was joy.",
            "Love does not claim possession, but gives freedom.",
            "We live in the world when we love it.",
            "If you cry because the sun has gone out of your life, your tears will prevent you from seeing the stars.",
            "The roots below the earth claim no rewards for making the branches fruitful.",
            "The small wisdom is like water in a glass: clear, transparent, pure. The great wisdom is like the water in the sea: dark, mysterious, impenetrable."
        ]
    },
    {
        "name": "Sri Aurobindo",
        "biography": "Sri Aurobindo, born Aurobindo Ghose in 1872 in Kolkata, India, was an Indian philosopher, yogi, guru, poet, and nationalist. After studying in England, he became a leader in the Indian independence movement before turning to spiritual practice and philosophy. He founded the Integral Yoga, a synthesis of different paths of yoga, and established the Sri Aurobindo Ashram in Pondicherry. Aurobindo's major works include 'The Life Divine,' 'Savitri,' and 'The Synthesis of Yoga,' where he explores the evolution of human consciousness and the potential for a divine life on earth.",
        "ideology": "Integral Yoga",
        "quotes": [
            "True knowledge is not attained by thinking. It is what you are; it is what you become.",
            "The first principle of true teaching is that nothing can be taught.",
            "All life is yoga.",
            "There is a soul within us that is greater than the present, a potential in us that is waiting to be born.",
            "The mind has to be made calm and still. Then it can reflect the divine truth.",
            "The only way to go beyond reason is through reason.",
            "He who would win high spiritual powers must first conquer the forces in his own mind.",
            "The body is the servant of the spirit. It must become pure, strong, and powerful, so that it can carry the spirit towards its divine goal.",
            "The sense of division is a delusion. Reality is one.",
            "To follow the law of one's own nature is the true Swadharma.",
            "The aim of Integral Yoga is not only to rise to the spiritual heights but to bring down their power and transform earthly life.",
            "The future of the earth depends on a change of consciousness.",
            "The Divine is in all, and all is in the Divine.",
            "Spirituality is not a rejection of life but a transformation of life.",
            "The evolution of man is the evolution of consciousness."
        ]
    },
    {
        "name": "Jiddu Krishnamurti",
        "biography": "Jiddu Krishnamurti was an Indian philosopher, speaker, and writer, born in 1895 in Madanapalle, India. Discovered by the Theosophical Society at a young age, he was groomed to be a world teacher, but he later renounced this role and all associated organizations, advocating for a path of individual discovery and inner transformation. Krishnamurti's teachings emphasize the importance of self-inquiry, psychological freedom, and the observation of one's thoughts without judgment. His works include 'The First and Last Freedom' and 'Freedom from the Known,' which explore themes of meditation, the nature of mind, and the quest for truth.",
        "ideology": "Self-Inquiry, Psychological Freedom",
        "quotes": [
            "Truth is a pathless land.",
            "It is no measure of health to be well adjusted to a profoundly sick society.",
            "The ability to observe without evaluating is the highest form of intelligence.",
            "The more you know yourself, the more clarity there is. Self-knowledge has no end - you don't come to an achievement; you don't come to a conclusion. It is an endless river.",
            "One is never afraid of the unknown; one is afraid of the known coming to an end.",
            "The highest form of human intelligence is to observe yourself without judgment.",
            "When one is aware of one's own being, one is no longer in conflict.",
            "In oneself lies the whole world, and if you know how to look and learn, the door is there and the key is in your hand. Nobody on earth can give you either that key or the door to open, except yourself.",
            "To understand the immeasurable, the mind must be extraordinarily quiet, still.",
            "Real learning comes about when the competitive spirit has ceased.",
            "Freedom from the desire for an answer is essential to the understanding of a problem.",
            "Meditation is to be aware of every thought and of every feeling, never to say it is right or wrong but just to watch it and move with it.",
            "We are second-hand people. We have lived by what we have been told, either guided by our inclinations, tendencies, or by circumstances and accidents.",
            "The moment you have in your heart this extraordinary thing called love and feel the depth, the delight, the ecstasy of it, you will discover that for you the world is transformed.",
            "The ending of sorrow is the beginning of wisdom."
        ]
    },
    {
        "name": "Ramana Maharshi",
        "biography": "Ramana Maharshi, born Venkataraman Iyer in 1879 in Tamil Nadu, India, was a renowned Hindu sage and proponent of Advaita Vedanta. At the age of 16, he experienced a profound spiritual awakening that led him to the holy mountain of Arunachala, where he spent the rest of his life. Ramana's teachings emphasize self-inquiry ('Who am I?') as a direct path to realizing one's true nature as pure consciousness. His major works include 'Who Am I?' and 'Forty Verses on Reality,' which outline his method of self-inquiry and his insights into the nature of reality.",
        "ideology": "Advaita Vedanta",
        "quotes": [
            "Your own Self-Realization is the greatest service you can render the world.",
            "There is neither creation nor destruction, neither destiny nor free will, neither path nor achievement. This is the final truth.",
            "The mind is by nature restless. Begin liberating it from its restlessness; give it peace; make it free from distractions; train it to look inward; make this a habit.",
            "The pure mind is itself Brahman; it therefore follows that Brahman is not other than the mind of the sage.",
            "Happiness is your nature. It is not wrong to desire it. What is wrong is seeking it outside when it is inside.",
            "No one succeeds without effort. Those who succeed owe their success to perseverance.",
            "Silence is also conversation.",
            "There is no greater mystery than this, that being the reality we seek to gain reality.",
            "God and the Guru are not really different; they are identical. He that has earned the grace of the Guru shall undoubtedly be saved and never forsaken, just as the prey that has been caught in the tiger's jaws will never be allowed to escape.",
            "The world is illusory; Brahman alone is real; Brahman is the world.",
            "Self-inquiry directly leads to Self-realization by removing the obstacles which make you think that the Self is not already realized.",
            "The truth is that the Self is not affected by any of the three states of waking, dream, and deep sleep, or by the life in this world or by the death of the body.",
            "When there are thoughts, it is distraction: when there are no thoughts, it is meditation.",
            "All activities should be done with one aim, which is realization."
        ]
    },
    {
        "name": "Swami Sivananda",
        "biography": "Swami Sivananda, born Kuppuswami Iyer in 1887 in Tamil Nadu, India, was a renowned Hindu spiritual teacher, yoga master, and founder of the Divine Life Society. Originally a physician, he turned to a life of spiritual practice and teaching, focusing on the synthesis of all yogic paths for the harmonious development of the physical, mental, and spiritual aspects of individuals. Sivananda's extensive writings, including 'Bliss Divine' and 'The Practice of Yoga,' cover various aspects of yoga, Vedanta, and spiritual life, emphasizing service, devotion, meditation, and self-discipline.",
        "ideology": "Integral Yoga, Vedanta",
        "quotes": [
            "Serve, love, give, purify, meditate, realize.",
            "Put your heart, mind, intellect, and soul even to your smallest acts. This is the secret of success.",
            "A mountain is composed of tiny grains of earth. The ocean is made up of tiny drops of water. Even so, life is but an endless series of little details, actions, speeches, and thoughts. And the consequences, whether good or bad of even the least of them are far-reaching.",
            "There is something good in all seeming failures. You are not to see that now. Time will reveal it. Be patient.",
            "Do not love leisure. Waste not a minute. Be bold. Realize the Truth, here and now!",
            "Humility is not cowardice. Meekness is not weakness. Humility and meekness are indeed spiritual powers.",
            "Life is not fully lived, life has not been fully realized, if you do not serve and love the entire humanity.",
            "Meditate and attain illumination.",
            "There is no end of craving. Hence contentment alone is the best way to happiness. Therefore, acquire contentment.",
            "A desire arises in the mind. It is satisfied immediately another comes. In the interval which separates two desires, a perfect calm reigns in the mind. It is at this moment freed from all thought, love, or hate.",
            "The harder the struggle, the more glorious the triumph. Self-realization demands very great struggle.",
            "Detach yourself from the world and its activities; stay quiet and devote the time to God and God alone.",
            "To live a pure unselfish life, one must count nothing as one's own in the midst of abundance.",
            "Forget like a child any injury done by somebody immediately. Never keep it in the heart. It kindles hatred."
        ]
    },
    {
        "name": "Sarvepalli Radhakrishnan",
        "biography": "Sarvepalli Radhakrishnan was an Indian philosopher, statesman, and one of the most distinguished twentieth-century scholars of comparative religion and philosophy. Born in 1888 in Tamil Nadu, India, he served as the first Vice President of India and the second President of India. Radhakrishnan's academic career was illustrious, with professorships at the University of Mysore, the University of Calcutta, and Oxford University. His works, including 'The Philosophy of Rabindranath Tagore' and 'An Idealist View of Life,' explore the synthesis of Eastern and Western philosophical traditions. He is celebrated for his efforts to bridge the cultural gap between India and the West.",
        "ideology": "Comparative Religion, Idealism",
        "quotes": [
            "Tolerance is the homage which the finite mind pays to the inexhaustibility of the infinite.",
            "The end-product of education should be a free creative man, who can battle against historical circumstances and adversities of nature.",
            "A life of joy and happiness is possible only on the basis of knowledge and science.",
            "Books are the means by which we build bridges between cultures.",
            "When we think we know, we cease to learn.",
            "The true teachers are those who help us think for ourselves.",
            "Reading a book gives us the habit of solitary reflection and true enjoyment.",
            "It is said that a nation marches on the stomachs of its soldiers, but it also marches on the minds of its scholars.",
            "Man is a paradoxical being - the constant glory and scandal of this world.",
            "Love thy neighbor as thyself because you are your neighbor. It is illusion that makes you think that your neighbor is someone other than yourself.",
            "Human life as we have it is only the raw material for human life as it might be.",
            "God lives, feels, and suffers in every one of us, and in course of time His attributes, knowledge, beauty, and love will be revealed in each of us.",
            "We should be self-sufficient in our qualities, not in our acquisitions.",
            "The world suffers a lot. Not because of the violence of bad people, but because of the silence of good people.",
            "The one self-knowledge worth having is to know one's own mind."
        ]
    },
    {
        "name": "B.R. Ambedkar",
        "biography": "Bhimrao Ramji Ambedkar, popularly known as B.R. Ambedkar, was an Indian jurist, economist, social reformer, and the principal architect of the Indian Constitution. Born in 1891 in Mhow, India, Ambedkar faced significant discrimination as a member of the Dalit community. Despite these challenges, he earned doctorates from Columbia University and the London School of Economics. Ambedkar's efforts in fighting social discrimination against untouchables and his campaigns for women's rights and labor rights are widely celebrated. His key works include 'The Annihilation of Caste' and 'The Buddha and His Dhamma.'",
        "ideology": "Social Justice, Constitutionalism, Buddhism",
        "quotes": [
            "I measure the progress of a community by the degree of progress which women have achieved.",
            "They cannot make history who forget history.",
            "If you believe in living a respectable life, you believe in self-help which is the best help.",
            "Life should be great rather than long.",
            "I like the religion that teaches liberty, equality, and fraternity.",
            "Cultivation of mind should be the ultimate aim of human existence.",
            "Democracy is not merely a form of government. It is primarily a mode of associated living, of conjoint communicated experience.",
            "Law and order are the medicine of the body politic and when the body politic gets sick, medicine must be administered.",
            "History shows that where ethics and economics come in conflict, victory is always with economics. Vested interests have never been known to have willingly divested themselves unless there was sufficient force to compel them.",
            "Indifferentism is the worst kind of disease that can affect people.",
            "Political tyranny is nothing compared to the social tyranny and a reformer who defies society is a more courageous man than a politician who defies government.",
            "Constitutional morality is not a natural sentiment. It has to be cultivated. We must realize that our people are yet to learn it.",
            "Equality may be a fiction but nonetheless one must accept it as a governing principle.",
            "The relationship between husband and wife should be one of closest friends.",
            "A great man is different from an eminent one in that he is ready to be the servant of the society."
        ]
    },
    {
        "name": "Dayananda Saraswati",
        "biography": "Dayananda Saraswati, born as Mool Shankar in 1824 in Gujarat, India, was a prominent Hindu religious leader and social reformer. He founded the Arya Samaj in 1875, which aimed to reform Hindu society by advocating for a return to the teachings of the Vedas. Dayananda Saraswati promoted principles such as monotheism, social equality, and the rejection of idol worship and ritualistic practices that he believed had corrupted Hinduism over time. His philosophy emphasized the Vedas as the true source of Hinduism and the importance of Vedic education for all.",
        "ideology": "Vedas, Arya Samaj",
        "quotes": [
            "I am convinced that everything has come down to us from the banks of the Ganges - astronomy, astrology, metempsychosis, etc.",
            "Swami Dayanand Saraswati was a distinguished scholar and an eminent Arya Samajist.",
            "The great man, the man of genius, is not a man who sees more than other men do, but he sees more of what is around him, he sees it more distinctly, more accurately.",
            "I like the religion that teaches liberty, equality, and fraternity.",
            "Cultivation of mind should be the ultimate aim of human existence.",
            "Democracy is not merely a form of government. It is primarily a mode of associated living, of conjoint communicated experience.",
            "Law and order are the medicine of the body politic and when the body politic gets sick, medicine must be administered.",
            "History shows that where ethics and economics come in conflict, victory is always with economics. Vested interests have never been known to have willingly divested themselves unless there was sufficient force to compel them.",
            "Indifferentism is the worst kind of disease that can affect people.",
            "Political tyranny is nothing compared to the social tyranny and a reformer who defies society is a more courageous man than a politician who defies government.",
            "Constitutional morality is not a natural sentiment. It has to be cultivated. We must realize that our people are yet to learn it.",
            "Equality may be a fiction but nonetheless one must accept it as a governing principle.",
            "The relationship between husband and wife should be one of closest friends.",
            "A great man is different from an eminent one in that he is ready to be the servant of the society."
        ]
    },
    {
        "name": "Ramana Maharshi",
        "biography": "Ramana Maharshi, born Venkataraman Iyer in 1879 in Tamil Nadu, India, was a renowned Hindu sage and proponent of Advaita Vedanta. At the age of 16, he experienced a profound spiritual awakening that led him to the holy mountain of Arunachala, where he spent the rest of his life. Ramana's teachings emphasize self-inquiry ('Who am I?') as a direct path to realizing one's true nature as pure consciousness. His major works include 'Who Am I?' and 'Forty Verses on Reality,' which outline his method of self-inquiry and his insights into the nature of reality.",
        "ideology": "Advaita Vedanta",
        "quotes": [
            "Your own Self-Realization is the greatest service you can render the world.",
            "There is neither creation nor destruction, neither destiny nor free will, neither path nor achievement. This is the final truth.",
            "The mind is by nature restless. Begin liberating it from its restlessness; give it peace; make it free from distractions; train it to look inward; make this a habit.",
            "The pure mind is itself Brahman; it therefore follows that Brahman is not other than the mind of the sage.",
            "Happiness is your nature. It is not wrong to desire it. What is wrong is seeking it outside when it is inside.",
            "No one succeeds without effort. Those who succeed owe their success to perseverance.",
            "Silence is also conversation.",
            "There is no greater mystery than this, that being the reality we seek to gain reality.",
            "God and the Guru are not really different; they are identical. He that has earned the grace of the Guru shall undoubtedly be saved and never forsaken, just as the prey that has been caught in the tiger's jaws will never be allowed to escape.",
            "The world is illusory; Brahman alone is real; Brahman is the world.",
            "Self-inquiry directly leads to Self-realization by removing the obstacles which make you think that the Self is not already realized.",
            "The truth is that the Self is not affected by any of the three states of waking, dream, and deep sleep, or by the life in this world or by the death of the body.",
            "When there are thoughts, it is distraction: when there are no thoughts, it is meditation.",
            "All activities should be done with one aim, which is realization."
        ]
    },
    {
        "name": "Kabir",
        "biography": "Kabir was a mystic poet and philosopher who lived in India during the 15th century. His life and teachings are often shrouded in legend and folklore, but his poetry remains widely influential in both Hinduism and Islam, reflecting a universal spirituality. Kabir's verses, collected in the Bijak, emphasize the unity of God and the rejection of religious rituals and dogmas. He advocated for a direct, personal experience of the divine and stressed the importance of living ethically and lovingly. Kabir's teachings continue to inspire seekers of truth and spiritual harmony.",
        "ideology": "Mysticism, Universal Spirituality",
        "quotes": [
            "Between the conscious and the unconscious, the mind has put up a swing: all earth creatures, even the supernovas, sway between these two trees, and it never winds down.",
            "The river that flows in you also flows in me.",
            "I laugh when I hear that the fish in the water is thirsty.",
            "Where do you search me? I am with you.",
            "If you don't break your ropes while you're alive, do you think ghosts will do it after?",
            "Don't open your diamonds in a vegetable market. Tie them in bundle and keep them in your heart, and go your own way.",
            "I am not a Hindu, nor a Muslim, am I? I am this body, a play of five elements; a drama of the spirit dancing with joy and sorrow.",
            "I am not a Hindu, nor a Muslim, am I? I am this body, a play of five elements; a drama of the spirit dancing with joy and sorrow.",
            "Tell me, O Swan, your ancient tale. From what land do you come, O Swan? to what shore will you fly?",
            "Tell me, O Swan, your ancient tale. From what land do you come, O Swan? to what shore will you fly?",
            "The Lord is in me, the Lord is in you, as life is in every seed, put false pride away and seek the Lord within.",
            "Love is of two kinds, one which commands, and one which obeys. The command type of love is not good; but the obeying type is excellent.",
            "Listen to the secret sound, the real sound, which is inside you.",
            "Where do you search me? I am with you.",
            "If you don't break your ropes while you're alive, do you think ghosts will do it after?",
            "Don't open your diamonds in a vegetable market. Tie them in bundle and keep them in your heart, and go your own way.",
            "I am not a Hindu, nor a Muslim, am I? I am this body, a play of five elements; a drama of the spirit dancing with joy and sorrow.",
            "Tell me, O Swan, your ancient tale. From what land do you come, O Swan? to what shore will you fly?",
            "The Lord is in me, the Lord is in you, as life is in every seed, put false pride away and seek the Lord within.",
            "Love is of two kinds, one which commands, and one which obeys. The command type of love is not good; but the obeying type is excellent."
        ]
    },
    {
        "name": "Mirabai",
        "biography": "Mirabai, also known as Meera Bai, was a 16th-century Hindu mystic poetess and devotee of Lord Krishna. Born into a royal family in Rajasthan, India, Mirabai became known for her unwavering devotion to Krishna from a young age, despite facing opposition from her family and society. Her poetry, infused with themes of love, longing, and spiritual union with the divine, continues to be cherished in the Bhakti movement. Mirabai's compositions, collected in the 'Padavali,' express her deep yearning for Krishna and her belief in the path of devotion (bhakti) as the means to attain spiritual liberation.",
        "ideology": "Bhakti, Devotion to Lord Krishna",
        "quotes": [
            "Do not cling to worldly things and desires; life is frail and fleeting. Remembering the Lord, sing the Lord's praises, and all pain will be forgotten.",
            "He has made the entire world his form, and is pervading it everywhere. So why call on him only in the temple?",
            "How can I explain what it's like to be separated from him? There's no support without the Lord.",
            "I have abandoned all other ways, and taken shelter with the Lord. I have renounced all pride, and I am now devoted to the Lord's lotus feet.",
            "It is impossible to find words to explain the greatness of this love. Mira's Lord is the court of miracles, and he has made his servant the servant of the humble.",
            "There's no one else like you. I can't find words to express what's in my heart.",
            "The essence of true love is to find the Lord's presence in everything.",
            "I've given up everything, and I'm not worried about anything else. There's no one else like you."
        ]
    },
    {
        "name": "Mahatma Gandhi",
        "biography": "Mahatma Gandhi, born Mohandas Karamchand Gandhi in 1869 in Gujarat, India, was a prominent leader of the Indian independence movement against British rule. Gandhi's philosophy of nonviolent resistance (Satyagraha) and his advocacy for civil rights and social justice made him a global icon of peaceful protest. He emphasized the principles of truth (Satya) and nonviolence (Ahimsa) as the foundation for social and political change. Gandhi's teachings influenced movements for civil rights and freedom across the world. His autobiography 'The Story of My Experiments with Truth' remains a classic in spiritual and political literature.",
        "ideology": "Nonviolence, Satyagraha",
        "quotes": [
            "Be the change that you wish to see in the world.",
            "The best way to find yourself is to lose yourself in the service of others.",
            "An eye for an eye only ends up making the whole world blind.",
            "Live as if you were to die tomorrow. Learn as if you were to live forever.",
            "The greatness of a nation can be judged by the way its animals are treated.",
            "You must be the change you wish to see in the world.",
            "The best way to find yourself is to lose yourself in the service of others.",
            "An eye for an eye only ends up making the whole world blind.",
            "Live as if you were to die tomorrow. Learn as if you were to live forever.",
            "The greatness of a nation can be judged by the way its animals are treated.",
            "I will not let anyone walk through my mind with their dirty feet.",
            "The best way to find yourself is to lose yourself in the service of others.",
            "An eye for an eye only ends up making the whole world blind.",
            "Live as if you were to die tomorrow. Learn as if you were to live forever.",
            "The greatness of a nation can be judged by the way its animals are treated.",
            "I will not let anyone walk through my mind with their dirty feet."
        ]
    },
    {
        "name": "Osho",
        "biography": "Osho, born as Chandra Mohan Jain in 1931 in Madhya Pradesh, India, later known as Bhagwan Shree Rajneesh and then as Osho, was a controversial spiritual teacher and mystic. He gained a large following in India and abroad for his teachings on meditation, spirituality, and personal growth. Osho's philosophy emphasized living fully in the present moment, transcending societal norms, and embracing individual freedom and responsibility. He introduced innovative meditation techniques, including dynamic meditation, aimed at achieving heightened awareness and inner peace.",
        "ideology": "Meditation, Spirituality, Individual Freedom",
        "quotes": [
            "Be realistic: Plan for a miracle.",
            "Don't be afraid of experience, because the more experience you have, the more mature you become.",
            "If you love a flower, don’t pick it up. Because if you pick it up it dies and it ceases to be what you love. So if you love a flower, let it be. Love is not about possession. Love is about appreciation.",
            "The moment a child is born, the mother is also born. She never existed before. The woman existed, but the mother, never. A mother is something absolutely new.",
            "The less people know, the more stubbornly they know it.",
            "Truth is not something outside to be discovered, it is something inside to be realized.",
            "To be creative means to be in love with life. You can be creative only if you love life enough that you want to enhance its beauty, you want to bring a little more music to it, a little more poetry to it, a little more dance to it.",
            "Creativity is the greatest rebellion in existence.",
            "When I say be creative, I don’t mean that you should all go and become great painters and great poets. I simply mean let your life be a painting, let your life be a poem.",
            "The ego is nothing but a whole that is pretending to be a part.",
            "There is no greater ecstasy than to know who you are.",
            "There is no need of any competition with anybody. You are yourself, and as you are, you are perfectly good.",
            "When love and hate are both absent, everything becomes clear and undisguised.",
            "I am not against thinking; I am against unnecessary thinking.",
            "The moment you become miserly you are closed to the basic phenomenon of life: expansion, sharing. The moment you start clinging to things, you have missed the target.",
            "The moment a child is born, the mother is also born. She never existed before. The woman existed, but the mother, never. A mother is something absolutely new.",
            "If you love a flower, don’t pick it up. Because if you pick it up it dies and it ceases to be what you love. So if you love a flower, let it be. Love is not about possession. Love is about appreciation.",
            "Be realistic: Plan for a miracle.",
            "Don't be afraid of experience, because the more experience you have, the more mature you become.",
            "If you love a flower, don’t pick it up. Because if you pick it up it dies and it ceases to be what you love. So if you love a flower, let it be. Love is not about possession. Love is about appreciation."
        ]
    },
    {
        "name": "Guru Nanak",
        "biography": "Guru Nanak, born in 1469 in Talwandi, now in Pakistan, was the founder of Sikhism and the first of the ten Sikh Gurus. He traveled widely, spreading the message of one God and the importance of living a truthful, honest life. Guru Nanak's teachings emphasized equality, social justice, and devotion to God. He advocated for the dismantling of the caste system and promoted the idea of universal brotherhood. His teachings are preserved in the Guru Granth Sahib, the holy scripture of Sikhism.",
        "ideology": "Equality, Social Justice, Devotion to God",
        "quotes": [
            "There is but one God. His name is Truth; He is the Creator, He fears none; He is without hate; He never dies; He is beyond the cycle of births and death. He is self-illuminated. He is realized by the kindness of the True Guru.",
            "Speak only that which will bring you honor.",
            "Let no man in the world live in delusion. Without a Guru, none can cross over to the other shore.",
            "Death would not be called bad, O people, if one knew how to truly die.",
            "I am neither a child, a young man, nor an ancient; nor am I of any caste.",
            "He who has no faith in himself can never have faith in God.",
            "God is one, but he has innumerable forms. He is the creator of all and He himself takes the human form.",
            "From its brilliancy everything is illuminated.",
            "Even kings and emperors with heaps of wealth and vast dominion cannot compare with an ant filled with the love of God.",
            "Let God's grace be the mosque, and devotion the prayer mat. Let the Quran be the good conduct."
        ]
    }
]